SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_usrt.c
#if (1 == HAL_PARAMETER_CHECK)
    /* check USRT pointer and p_init address */
    if((NULL == usrt) || (NULL == p_init)){
        HAL_DEBUGE("pointer [usrt] or [p_init] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    
    /* check periph parameter */
    if((USART0 != periph) && (USART1 != periph)){
        HAL_DEBUGE("parameter [periph] value is invalid"); 
        return HAL_ERR_VAL;
    }
    
    /* check periph value from USRT device struct */
    if(0U != usrt->periph){
        HAL_DEBUGI("periph value from usrt device struct has been rewrite");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    usrt->periph = periph;
    
    usart_disable(periph);
    
    /* CTL0 register configure */
    reg_temp = USART_CTL0(periph);
    reg_temp &= ~(USART_CTL0_PM | USART_CTL0_PCEN | USART_CTL0_WL | \
                  USART_CTL0_REN | USART_CTL0_TEN);
    reg_temp |= (p_init->direction | p_init->parity | p_init->word_length);
    USART_CTL0(periph) = reg_temp;
    
    /* CTL1 register configure */
    reg_temp = USART_CTL1(periph);
    reg_temp &= ~(USART_CTL1_STB | USART_CTL1_CLEN | USART_CTL1_CPH | USART_CTL1_CPL);
    reg_temp |= (p_init->stop_bit | p_init->clock_length_lastbit | p_init->clock_phase | \
                p_init->clock_polarity | USART_CTL1_CKEN);
    USART_CTL1(periph) = reg_temp;
    
    /* boudrate configure */
    usart_baudrate_set(periph, p_init->baudrate);
    usrt->data_bit_mask = _usrt_data_bit_mask_get(usrt);
    
    /* reset the Rx and Tx state */
    usrt->tx_state = USRT_STATE_FREE;
    usrt->rx_state = USRT_STATE_FREE;
    
    return HAL_ERR_NONE;
}

/*!
    \brief      start USRT module
    \param[in]  usrt: USRT device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_usrt_start(hal_usrt_dev_struct *usrt)
{
    usart_enable(usrt->periph);
}

/*!
    \brief      stop USRT module
    \param[in]  usrt: USRT device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_usrt_stop(hal_usrt_dev_struct *usrt)
{
    usart_disable(usrt->periph);
}

/*!
    \brief      handle the USRT interrupts
    \param[in]  usrt: USRT device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_usrt_irq(hal_usrt_dev_struct *usrt)
{
    if(RESET == _usrt_error_flag_get(usrt)){
        /* check whether USART is in receiver mode or not */
        if(RESET != usart_interrupt_flag_get(usrt->periph, USART_INT_FLAG_RBNE)){
            if(NULL != usrt->usrt_irq.receive_complete_handle){
                usrt->usrt_irq.receive_complete_handle(usrt);
            }
            return;
        }
    }else{
        /* check whether the PERR flag is set or not */
        if(RESET != usart_interrupt_flag_get(usrt->periph, USART_INT_FLAG_PERR)){
            usart_interrupt_flag_clear(usrt->periph, USART_INT_FLAG_PERR);
            usrt->error_state |= HAL_USART_ERROR_PERR;
            usrt->last_error = HAL_USART_ERROR_PERR;
        }
        
        /* check whether the NERR flag is set or not */
        if(RESET != usart_interrupt_flag_get(usrt->periph, USART_INT_FLAG_ERR_NERR)){
            usart_interrupt_flag_clear(usrt->periph, USART_INT_FLAG_ERR_NERR);
            usrt->error_state |= HAL_USART_ERROR_NERR;
            usrt->last_error = HAL_USART_ERROR_NERR;
        }
        
        /* check whether the FERR flag is set or not */
        if(RESET != usart_interrupt_flag_get(usrt->periph, USART_INT_FLAG_ERR_FERR)){
            usart_interrupt_flag_clear(usrt->periph, USART_INT_FLAG_ERR_FERR);
            usrt->error_state |= HAL_USART_ERROR_FERR;
            usrt->last_error = HAL_USART_ERROR_FERR;
        }
        
        /* check whether the ERR ORERR is set or not */
        if(RESET != usart_interrupt_flag_get(usrt->periph, USART_INT_FLAG_ERR_ORERR)){ 
            usart_interrupt_flag_clear(usrt->periph, USART_INT_FLAG_ERR_ORERR);
            usrt->error_state |= HAL_USART_ERROR_ORERR;
            usrt->last_error = HAL_USART_ERROR_ORERR;
        }
        
        /* check whether RBNE ORERR is set or not */
        if(RESET != usart_interrupt_flag_get(usrt->periph, USART_INT_FLAG_RBNE_ORERR)){ 
            usart_interrupt_flag_clear(usrt->periph, USART_INT_FLAG_RBNE_ORERR);
            usrt->error_state |= HAL_USART_ERROR_ORERR;
            usrt->last_error = HAL_USART_ERROR_ORERR;
        }
        
        /* check whether error state is none or not */
        if(HAL_USART_ERROR_NONE != usrt->error_state){
            if(NULL != usrt->usrt_irq.error_handle){
                usrt->usrt_irq.error_handle(usrt);
                usrt->error_state = HAL_USART_ERROR_NONE;
            }
            return;
        }
    }
    
    /* transmitter buffer empty interrupt handle */
    if(RESET != usart_interrupt_flag_get(usrt->periph, USART_INT_FLAG_TBE)){
        if(NULL != usrt->usrt_irq.transmit_ready_handle){
            usrt->usrt_irq.transmit_ready_handle(usrt);
        }
        
        return;
    }
    /* transmission complete interrupt handle */
    if(RESET != usart_interrupt_flag_get(usrt->periph, USART_INT_FLAG_TC)){
        usart_interrupt_flag_clear(usrt->periph, USART_INT_FLAG_TC);
        
        if(NULL != usrt->usrt_irq.transmit_complete_handle){
            usrt->usrt_irq.transmit_complete_handle(usrt);
        }
        
        return;
    }
}

/*!
    \brief      set user-defined interrupt callback function, 
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  usrt: USRT device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: point to USRT interrupt callback functions structure
                  The structure member can be assigned as following parameters:
      \arg        hal_irq_handle_cb function pointer: the function is user-defined,
                    the corresponding callback mechanism is in use, and enable corresponding interrupt
      \arg        NULL: The corresponding callback mechanism is out of use, and
                    disable corresponding interrupt
      \arg        HAL_INTERRUPT_ENABLE_ONLY: The corresponding callback mechanism is out of use, 
                    while enable corresponding interrupt
    \param[out] none
    \retval     none
*/
void hal_usrt_irq_handle_set(hal_usrt_dev_struct *usrt, hal_usrt_irq_struct *p_irq)
{
    /* set user-defined error interrupt callback */
    if(NULL != p_irq->error_handle){
        usrt->usrt_irq.error_handle = p_irq->error_handle;
        usart_interrupt_enable(usrt->periph, USART_INT_ERR);
        usart_interrupt_enable(usrt->periph, USART_INT_PERR);
    }else{
        usrt->usrt_irq.error_handle = NULL;
        usart_interrupt_disable(usrt->periph, USART_INT_ERR);
        usart_interrupt_disable(usrt->periph, USART_INT_PERR);
    }
    
