SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_usrt.c
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == usrt) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [usrt] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the rx_state wheher is busy or not */
    if(USRT_STATE_BUSY == usrt->rx_state){
        HAL_DEBUGE("usrt rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* calculate the data length */
    data_length = 1;
    if(RESET != (USART_CTL0(usrt->periph) & USART_CTL0_WL)){
        if(RESET == (USART_CTL0(usrt->periph) & USART_CTL0_PCEN)){
            data_length = 2U;
        }
    }
    
    /* initialize receive parameters */
    usrt->error_state = HAL_USART_ERROR_NONE;
    usrt->rxbuffer.buffer = (uint8_t *)p_buffer; 
    usrt->rxbuffer.length = length;
    usrt->rxbuffer.pos = 0U;
    usrt->data_bit_mask = _usrt_data_bit_mask_get(usrt);
    usrt->rx_state = USRT_STATE_BUSY;
    /* configure timeout */
    tick_start = hal_basetick_count_get();
    
    temp_val = usrt->rxbuffer.pos;
    while(temp_val < usrt->rxbuffer.length){
       /* send dummy byte to generate clock for the slave to send data */
        while(RESET == usart_flag_get(usrt->periph, USART_FLAG_TC)){
            if(HAL_TIMEOUT_FOREVER != timeout_ms){
                if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                    HAL_DEBUGW("usrt transmit timeout");
                    /* reset the state */
                    usrt->rx_state = USRT_STATE_FREE;
                    return HAL_ERR_TIMEOUT;
                }
                usart_data_transmit(usrt->periph, USRT_DUMMY_DATA);
            }
        }
        
        /* reconfigure the timeout */
        tick_start = hal_basetick_count_get();
        /* wait for read data buffer not empty */
        while(RESET == usart_flag_get(usrt->periph, USART_FLAG_RBNE)){
            if(HAL_TIMEOUT_FOREVER != timeout_ms){
                if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                    HAL_DEBUGW("usrt receive timeout");
                    /* reset the state */
                    usrt->rx_state = USRT_STATE_FREE;
                    return HAL_ERR_TIMEOUT;
                }            
            }
        }
        
        /* read data from data register */
        if(1U == data_length){
            *usrt->rxbuffer.buffer = (uint8_t)(usart_data_receive(usrt->periph) & usrt->data_bit_mask);
            usrt->rxbuffer.buffer++;
        }else{
            *(uint16_t*)usrt->rxbuffer.buffer = (usart_data_receive(usrt->periph) & usrt->data_bit_mask);
             usrt->rxbuffer.buffer += data_length;
        }
        
        /* change the receive pointer */
        usrt->rxbuffer.pos++;
        temp_val = usrt->rxbuffer.pos;
    }
    
    /* change the Rx state to free */
    usrt->rx_state = USRT_STATE_FREE;

    return HAL_ERR_NONE;
}

/*!
    \brief      transmit & receive amounts of data, poll transfer process and completed status
                the function is blocking
    \param[in]  usrt: USRT device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_tx_buffer: pointer to Tx data buffer
    \param[in]  p_rx_buffer: pointer to Rx data buffer
    \param[in]  length: number of data to be received
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32e23x_hal.h
*/
int32_t hal_usrt_transmit_receive_poll(hal_usrt_dev_struct *usrt, void *p_tx_buffer, void *p_rx_buffer, \
                                uint32_t length, uint32_t timeout_ms)
{
    uint32_t data_length;
    uint32_t temp_val;
    uint32_t tick_start;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == usrt) || (NULL == p_tx_buffer) || (NULL == p_rx_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [usrt] or [p_tx_buffer] or [p_rx_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* 9-bit transfer with no parity, if tx or rx buffer address is not aligned on uint16_t, return error */
    if((RESET != (USART_CTL0(usrt->periph) & USART_CTL0_WL)) && \
        (RESET == (USART_CTL0(usrt->periph) & USART_CTL0_PCEN))){
        if(RESET != (((uint32_t)p_tx_buffer || (uint32_t)p_rx_buffer) & 1U)){
            return HAL_ERR_ADDRESS;
        }
    }
    
    /* check the rx_state wheher is busy or not */
    if(USRT_STATE_BUSY == usrt->rx_state){
        HAL_DEBUGE("usrt rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* calculate the data length */
    data_length = 1;
    if(RESET != (USART_CTL0(usrt->periph) & USART_CTL0_WL)){
        if(RESET == (USART_CTL0(usrt->periph) & USART_CTL0_PCEN)){
            data_length = 2U;
        }
    }
    
    /* initialize receive parameters */
    usrt->error_state = HAL_USART_ERROR_NONE;
    usrt->rxbuffer.buffer = (uint8_t *)p_rx_buffer;
    usrt->rxbuffer.length = length;
    usrt->rxbuffer.pos = 0U;
    usrt->data_bit_mask = _usrt_data_bit_mask_get(usrt);
    usrt->rx_state = USRT_STATE_BUSY;
    
    /* initialize transmit parameters */
    usrt->txbuffer.buffer = (uint8_t *)p_tx_buffer;
    usrt->txbuffer.length = length;
    usrt->tx_state = USRT_STATE_BUSY;
    
    /* configure timeout */
    tick_start = hal_basetick_count_get();
    
    temp_val = usrt->rxbuffer.pos;
    while(temp_val < usrt->rxbuffer.length){
        /* wait the TBE flag is set */
        while(RESET == usart_flag_get(usrt->periph, USART_FLAG_TBE)){
            if(HAL_TIMEOUT_FOREVER != timeout_ms){
                if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                    HAL_DEBUGW("usrt TBE flag set timeout");
                    /* reset the state */
                    usrt->tx_state = USRT_STATE_FREE;
                    return HAL_ERR_TIMEOUT;
                }
            }
        }
        
        /* send the data to be transmitted */
        if(1U == data_length){
            usart_data_transmit(usrt->periph, (*usrt->txbuffer.buffer & (uint8_t)usrt->data_bit_mask));
            usrt->txbuffer.buffer++;
        }else{
            usart_data_transmit(usrt->periph, (*(uint16_t*)usrt->txbuffer.buffer & usrt->data_bit_mask));
            usrt->txbuffer.buffer += data_length;
        }
        
        /* wait for transmit complete */
        while(RESET == usart_flag_get(usrt->periph, USART_FLAG_TC)){
            if(HAL_TIMEOUT_FOREVER != timeout_ms){
                if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                    HAL_DEBUGW("usrt transmit timeout");
                    return HAL_ERR_TIMEOUT;
                }
            }
        }
        
