SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_usrt.c
        /* wait the RBNE flag is set */
        while(RESET == usart_flag_get(usrt->periph, USART_FLAG_RBNE)){
            if(HAL_TIMEOUT_FOREVER != timeout_ms){
                if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                    HAL_DEBUGW("usrt RBNE flag set timeout");
                    /* reset the state */
                    usrt->rx_state = USRT_STATE_FREE;
                    return HAL_ERR_TIMEOUT;
                }
            }
        }
        
        /* read data from data register */
        if(1U == data_length){
            *usrt->rxbuffer.buffer = (uint8_t)(usart_data_receive(usrt->periph) & usrt->data_bit_mask);
            usrt->rxbuffer.buffer++;
        }else{
            *(uint16_t*)usrt->rxbuffer.buffer = (usart_data_receive(usrt->periph) & usrt->data_bit_mask);
             usrt->rxbuffer.buffer += data_length;
        }
        
        /* change the receive pointer */
        usrt->rxbuffer.pos++;
        temp_val = usrt->rxbuffer.pos;
    }
    
    /* change the Tx and Rx state to free */
    usrt->tx_state = USRT_STATE_FREE;
    usrt->rx_state = USRT_STATE_FREE;

    return HAL_ERR_NONE;
}

/*!
    \brief      transmit amounts of data by interrupt method, after the transfer is completed, 
                the user function is called
                the function is non-blocking
    \param[in]  usrt: USRT device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be transmitted
    \param[in]  p_user_func: user callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32e23x_hal.h 
*/
int32_t hal_usrt_transmit_interrupt(hal_usrt_dev_struct *usrt, void *p_buffer, \
                                     uint32_t length, hal_usrt_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == usrt) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [usrt] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the tx_state wheher is busy or not */
    if(USRT_STATE_BUSY == usrt->tx_state){
        HAL_DEBUGE("usrt tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* initialize transmit parameters */
    usrt->tx_state = USRT_STATE_BUSY;
    usrt->error_state = HAL_USART_ERROR_NONE;
    usrt->txbuffer.buffer = (uint8_t *)p_buffer; 
    usrt->txbuffer.length = length;
    usrt->txbuffer.pos = 0U;
    usrt->tx_callback = (void *)p_user_func;
    /* configure the transmit ready and complete callback as the function implemented */
    usrt->usrt_irq.transmit_ready_handle = _usrt_transmit_interrupt;
    usrt->usrt_irq.transmit_complete_handle = _usrt_transmit_complete_interrupt;
    
    /* clear USART TC interrupt flag */
    usart_interrupt_flag_clear(usrt->periph, USART_INT_FLAG_TC);

    /* enable the TBE interrupt */
    usart_interrupt_enable(usrt->periph, USART_INT_TBE);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data by interrupt method, after the transfer is completed, 
                the user function is called 
                the function is non-blocking
    \param[in]  usrt: USRT device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be received
    \param[in]  p_user_func: user callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32e23x_hal.h
*/
int32_t hal_usrt_receive_interrupt(hal_usrt_dev_struct *usrt, void *p_buffer, \
                                    uint32_t length, hal_usrt_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == usrt) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [usrt] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the rx_state wheher is busy or not */
    if(USRT_STATE_BUSY == usrt->rx_state){
        HAL_DEBUGE("usrt rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* initialize receive parameters */
    usrt->rx_state = USRT_STATE_BUSY;
    usrt->error_state = HAL_USART_ERROR_NONE;
    usrt->rxbuffer.buffer = (uint8_t *)p_buffer; 
    usrt->rxbuffer.length = length;
    usrt->rxbuffer.pos = 0U;
    usrt->rx_callback = (void *)p_user_func;
    usrt->usrt_irq.receive_complete_handle = _usrt_receive_interrupt;
    usrt->data_bit_mask = _usrt_data_bit_mask_get(usrt);
    
    /* enable PERR, ERR, RBNE interrupt */
    usart_interrupt_enable(usrt->periph, USART_INT_PERR);
    usart_interrupt_enable(usrt->periph, USART_INT_ERR);
    usart_interrupt_enable(usrt->periph, USART_INT_RBNE);
    
    /* send dummy byte to generate clock for the slave to send data */
    usart_data_transmit(usrt->periph, USRT_DUMMY_DATA & _usrt_data_bit_mask_get(usrt));
    
    return HAL_ERR_NONE;
}

/*!
    \brief      transmit & receive amounts of data by interrupt method, after the transfer is completed, 
                the user function is called 
                the function is non-blocking
    \param[in]  usrt: USRT device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_tx_buffer: pointer to Tx data buffer
    \param[in]  p_rx_buffer: pointer to Rx data buffer
    \param[in]  length: number of data to be received
    \param[in]  p_user_func: user callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32e23x_hal.h
*/
int32_t hal_usrt_transmit_receive_interrupt(hal_usrt_dev_struct *usrt, void *p_tx_buffer, void *p_rx_buffer, \
                                    uint32_t length, hal_usrt_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == usrt) || (NULL == p_tx_buffer) || (NULL == p_rx_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [usrt] or [p_tx_buffer] or [p_rx_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
