SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_usrt.c
    /* 9-bit transfer with no parity, if tx or rx buffer address is not aligned on uint16_t, return error */
    if((RESET != (USART_CTL0(usrt->periph) & USART_CTL0_WL)) && \
        (RESET == (USART_CTL0(usrt->periph) & USART_CTL0_PCEN))){
        if(RESET != (((uint32_t)p_tx_buffer || (uint32_t)p_rx_buffer) & 1U)){
            return HAL_ERR_ADDRESS;
        }
    }
    
    /* check the rx_state wheher is in busy Tx Rx or not */
    if(USRT_STATE_BUSY_TX_RX == usrt->rx_state){
        HAL_DEBUGE("usrt tx or rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* initialize transmit parameters */
    usrt->error_state = HAL_USART_ERROR_NONE;
    usrt->tx_state = USRT_STATE_BUSY_TX_RX;
    usrt->txbuffer.buffer = (uint8_t *)p_tx_buffer; 
    usrt->txbuffer.length = length;
    usrt->txbuffer.pos = 0U;
    usrt->usrt_irq.transmit_ready_handle = _usrt_tx_rx_interrupt;
    usrt->usrt_irq.transmit_complete_handle = _usrt_transmit_complete_interrupt;
    
    /* initialize receive parameters */
    usrt->rx_state = USRT_STATE_BUSY_TX_RX;
    usrt->rxbuffer.buffer = (uint8_t *)p_rx_buffer; 
    usrt->rxbuffer.length = length;
    usrt->rxbuffer.pos = 0U;
    usrt->rx_callback = (void *)p_user_func;
    usrt->usrt_irq.receive_complete_handle = _usrt_tx_rx_interrupt;
    usrt->data_bit_mask = _usrt_data_bit_mask_get(usrt);
    
    /* clear USART TC interrupt flag */
    usart_interrupt_flag_clear(usrt->periph, USART_INT_FLAG_TC);

    /* enable PERR, ERR, RBNE, TBE interrupt */
    usart_interrupt_enable(usrt->periph, USART_INT_PERR);
    usart_interrupt_enable(usrt->periph, USART_INT_ERR);
    usart_interrupt_enable(usrt->periph, USART_INT_RBNE);
    usart_interrupt_enable(usrt->periph, USART_INT_TBE);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      transmit amounts of data by DMA method, after the transfer is completed or error occurs, 
                the user function is called 
                the function is non-blocking
    \param[in]  usrt: USRT device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be transmitted
    \param[in]  p_func: pointer to callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32e23x_hal.h
*/
int32_t hal_usrt_transmit_dma(hal_usrt_dev_struct *usrt, void *p_buffer, \
                              uint32_t length, hal_usrt_user_callback_struct *p_func)
{
    hal_dma_irq_struct dma_irq;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == usrt) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [usrt] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
    
    /* check the parameter */
    if(NULL == usrt->p_dma_tx){
        HAL_DEBUGE("parameter [usrt->p_dma_tx] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the tx_state wheher is busy or not */
    if(USRT_STATE_BUSY == usrt->tx_state){
        HAL_DEBUGE("usrt tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* initialize DMA interrupt callback function structure with default value */
    hal_dma_struct_init(HAL_DMA_IRQ_STRUCT, &dma_irq);
    
    /* initialize transmit parameters */
    usrt->tx_state = USRT_STATE_BUSY;
    usrt->error_state = HAL_USART_ERROR_NONE;
    usrt->txbuffer.buffer = (uint8_t *)p_buffer; 
    usrt->txbuffer.length = length;
    usrt->txbuffer.pos = 0U;
    if(NULL != p_func){
        usrt->tx_callback = (void *)p_func->complete_func;
        usrt->usrt_irq.error_handle = (hal_irq_handle_cb)p_func->error_func;
    }else{
        usrt->tx_callback = NULL;
        usrt->usrt_irq.error_handle = NULL;
    }
    usrt->usrt_irq.transmit_complete_handle = _usrt_transmit_complete_interrupt;
    
    /* configure DMA interrupt callback function */
    dma_irq.full_finish_handle = _usrt_transmit_dma;
    dma_irq.error_handle = _usrt_dma_error;
    if(NULL != usrt->p_dma_tx->dma_irq.half_finish_handle){
        dma_irq.half_finish_handle = usrt->p_dma_tx->dma_irq.half_finish_handle;
    }
    
    /* start DMA interrupt mode transfer */
    hal_dma_start_interrupt(usrt->p_dma_tx, (uint32_t)usrt->txbuffer.buffer, \
                           usrt->periph + 0x28U, length, &dma_irq);
    /* clear DMA global interrupt flag */
    dma_flag_clear(usrt->p_dma_tx->channel, DMA_FLAG_G);
    
    /* clear USART TC interrupt flag */
    usart_interrupt_flag_clear(usrt->periph, USART_INT_FLAG_TC);

    /* DMA enable for transmission */
    usart_dma_transmit_config(usrt->periph, USART_DENT_ENABLE);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data by DMA method, after the transfer is completed or error occurs, 
                the user function is called     
                the function is non-blocking
    \param[in]  usrt: USRT device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be received
    \param[in]  p_func: pointer to callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32e23x_hal.h
*/
int32_t hal_usrt_receive_dma(hal_usrt_dev_struct *usrt, void *p_buffer, \
                              uint32_t length, hal_usrt_user_callback_struct *p_func)
{
    hal_dma_irq_struct dma_irq;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == usrt) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [usrt] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
    
    /* check the parameter */
    if(NULL == usrt->p_dma_rx){
        HAL_DEBUGE("parameter [usrt->p_dma_rx] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the rx_state wheher is busy or not */
    if(USRT_STATE_BUSY == usrt->rx_state){
        HAL_DEBUGE("usrt rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* initialize DMA interrupt callback function structure with default value */
    hal_dma_struct_init(HAL_DMA_IRQ_STRUCT, &dma_irq);
    
