SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_usrt.c
    /* initialize receive parameters */
    usrt->rx_state = USRT_STATE_BUSY;
    usrt->error_state = HAL_USART_ERROR_NONE;
    usrt->rxbuffer.buffer = (uint8_t *)p_buffer; 
    usrt->rxbuffer.length = length;
    usrt->rxbuffer.pos = 0U;
    if(NULL != p_func){
        usrt->rx_callback = (void *)p_func->complete_func;
        usrt->usrt_irq.error_handle = (hal_irq_handle_cb)p_func->error_func;
    }else{
        usrt->rx_callback = NULL;
        usrt->usrt_irq.error_handle = NULL;
    }
    usrt->data_bit_mask = _usrt_data_bit_mask_get(usrt);
    
    /* enable the usart parity error and error interrupt: (frame error, noise error, overrun error) */
    usart_interrupt_enable(usrt->periph, USART_INT_PERR);
    usart_interrupt_enable(usrt->periph, USART_INT_ERR);
    
    /* configure DMA interrupt interrupt callback function */
    dma_irq.full_finish_handle = _usrt_receive_dma;
    dma_irq.error_handle = _usrt_dma_error;
    if(NULL != usrt->p_dma_rx->dma_irq.half_finish_handle){
        dma_irq.half_finish_handle = usrt->p_dma_rx->dma_irq.half_finish_handle;
    }
    
    hal_dma_start_interrupt(usrt->p_dma_rx, usrt->periph + 0x24U, \
                           (uint32_t)usrt->rxbuffer.buffer, length, &dma_irq);
    
    /* USRT transmit data by DMA to generate clock */
    dma_irq.full_finish_handle = NULL;
    dma_irq.half_finish_handle = NULL;
    dma_irq.error_handle = NULL;
    
    /* start DMA interrupt mode transfer */
    hal_dma_start_interrupt(usrt->p_dma_tx, (uint32_t)usrt->rxbuffer.buffer, \
                           usrt->periph + 0x28U, length, &dma_irq);
    
    /* clear DMA global interrupt flag */
    dma_flag_clear(usrt->p_dma_tx->channel, DMA_FLAG_G);
    /* DMA enable for reception and transmission */
    usart_dma_receive_config(usrt->periph, USART_DENR_ENABLE);
    usart_dma_transmit_config(usrt->periph, USART_DENT_ENABLE);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      transmit & receive amounts of data by DMA method, after the transfer is completed or error occurs, 
                the user function is called 
                the function is non-blocking
    \param[in]  usrt: USRT device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_tx_buffer: pointer to Tx data buffer
    \param[in]  p_rx_buffer: pointer to Rx data buffer
    \param[in]  length: number of data to be received
    \param[in]  p_func: pointer to callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32e23x_hal.h
*/
int32_t hal_usrt_transmit_receive_dma(hal_usrt_dev_struct *usrt, void *p_tx_buffer, void *p_rx_buffer, \
                                    uint32_t length, hal_usrt_user_callback_struct *p_func)
{
    hal_dma_irq_struct dma_irq;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == usrt) || (NULL == p_tx_buffer) || (NULL == p_rx_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [usrt] or [p_tx_buffer] or [p_rx_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
    
    /* check the parameter */
    if(NULL == usrt->p_dma_tx){
        HAL_DEBUGE("parameter [usrt->p_dma_tx] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the tx_state wheher is busy Tx Rx or not */
    if(USRT_STATE_BUSY_TX_RX == usrt->tx_state){
        HAL_DEBUGE("usrt tx or rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* initialize DMA interrupt callback function structure with default value */
    hal_dma_struct_init(HAL_DMA_IRQ_STRUCT, &dma_irq);
    
    /* initialize receive parameters */
    usrt->rx_state = USRT_STATE_BUSY_TX_RX;
    usrt->error_state = HAL_USART_ERROR_NONE;
    usrt->rxbuffer.buffer = (uint8_t *)p_rx_buffer; 
    usrt->rxbuffer.length = length;
    usrt->rxbuffer.pos = 0U;
    if(NULL != p_func){
        usrt->rx_callback = (void *)p_func->complete_func;
        usrt->usrt_irq.error_handle = (hal_irq_handle_cb)p_func->error_func;
    }else{
        usrt->rx_callback = NULL;
        usrt->usrt_irq.error_handle = NULL;
    }
    usrt->data_bit_mask = _usrt_data_bit_mask_get(usrt);
    
    /* enable the usart parity error and error interrupt: (frame error, noise error, overrun error) */
    usart_interrupt_enable(usrt->periph, USART_INT_PERR);
    usart_interrupt_enable(usrt->periph, USART_INT_ERR);
    
    /* configure DMA interrupt interrupt callback function */
    dma_irq.full_finish_handle = _usrt_receive_dma;
    dma_irq.error_handle = _usrt_dma_error;
    if(NULL != usrt->p_dma_rx->dma_irq.half_finish_handle){
        dma_irq.half_finish_handle = usrt->p_dma_rx->dma_irq.half_finish_handle;
    }
    
    /* start DMA interrupt mode transfer */
    hal_dma_start_interrupt(usrt->p_dma_rx, usrt->periph + 0x24U, \
                           (uint32_t)usrt->rxbuffer.buffer, length, &dma_irq);
    
    /* initialize transmit parameters */
    usrt->tx_state = USRT_STATE_BUSY_TX_RX;
    usrt->txbuffer.buffer = (uint8_t *)p_tx_buffer; 
    usrt->txbuffer.length = length;
    usrt->txbuffer.pos = 0U;
    if(NULL != p_func){
        usrt->tx_callback = (void *)p_func->complete_func;
    }else{
        usrt->tx_callback = NULL;
    }
    usrt->usrt_irq.transmit_complete_handle = _usrt_transmit_complete_interrupt;
    
    /* configure DMA interrupt callback function */
    dma_irq.full_finish_handle = _usrt_transmit_dma;
    dma_irq.error_handle = _usrt_dma_error;
    if(NULL != usrt->p_dma_tx->dma_irq.half_finish_handle){
        dma_irq.half_finish_handle = usrt->p_dma_tx->dma_irq.half_finish_handle;
    }
    
    /* start DMA interrupt mode transfer */
    hal_dma_start_interrupt(usrt->p_dma_tx, (uint32_t)usrt->txbuffer.buffer, \
                           usrt->periph + 0x28U, length, &dma_irq);
    /* clear DMA global interrupt flag and USART TC flag */
    dma_flag_clear(usrt->p_dma_tx->channel, DMA_FLAG_G);
    usart_flag_clear(usrt->periph, USART_FLAG_TC);
    /* DMA enable for reception and transmission */
    usart_dma_receive_config(usrt->periph, USART_DENR_ENABLE);
    usart_dma_transmit_config(usrt->periph, USART_DENT_ENABLE);
    
