SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_usrt.c
    return HAL_ERR_NONE;
}

/*!
    \brief      pause USRT DMA transfer during transmission process
    \param[in]  usrt: USRT device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32e23x_hal.h
*/
int32_t hal_usrt_dma_pause(hal_usrt_dev_struct *usrt)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == usrt){
        HAL_DEBUGE("parameter [usrt] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the tx_state wheher is busy or not */
    if(USRT_STATE_BUSY == usrt->tx_state){
        /* disable DMA transimt */
        usart_dma_transmit_config(usrt->periph, USART_DENT_DISABLE);
    }
    
    /* check the rx_state wheher is busy or not */
    if(USRT_STATE_BUSY == usrt->rx_state){
        /* disable the PERR and ERR interrupt */
        usart_interrupt_disable(usrt->periph, USART_INT_PERR);
        usart_interrupt_disable(usrt->periph, USART_INT_ERR);
        
        /* disable DMA receive */
        usart_dma_receive_config(usrt->periph, USART_DENR_DISABLE);
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      resume USRT DMA transfer during transmission process
    \param[in]  usrt: USRT device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32e23x_hal.h
*/
int32_t hal_usrt_dma_resume(hal_usrt_dev_struct *usrt)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == usrt){
        HAL_DEBUGE("parameter [usrt] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the tx_state wheher is busy or not */
    if(USRT_STATE_BUSY == usrt->tx_state){
        /* enable DMA transimt */
        usart_dma_transmit_config(usrt->periph, USART_DENT_ENABLE);
    }
    
    /* check the rx_state wheher is busy or not */
    if(USRT_STATE_BUSY == usrt->rx_state){
        /* enable the PERR and ERR interrupt */
        usart_interrupt_enable(usrt->periph, USART_INT_PERR);
        usart_interrupt_enable(usrt->periph, USART_INT_ERR);
        
        /* enable DMA receive */
        usart_dma_receive_config(usrt->periph, USART_DENR_ENABLE);
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      stop USRT transmit and receive transfer 
                the function is blocking
    \param[in]  usrt: USRT device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32e23x_hal.h
*/
int32_t hal_usrt_transfer_stop(hal_usrt_dev_struct *usrt)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == usrt){
        HAL_DEBUGE("parameter [usrt] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* disable the TBE and TC interrupt */
    usart_interrupt_disable(usrt->periph, USART_INT_TBE);
    usart_interrupt_disable(usrt->periph, USART_INT_TC);
    /* disable the RBNE, PERR and ERR interrupt */
    usart_interrupt_disable(usrt->periph, USART_INT_RBNE);
    usart_interrupt_disable(usrt->periph, USART_INT_PERR);
    usart_interrupt_disable(usrt->periph, USART_INT_ERR);
    
    /* disable DMA transimt and stop DMA */
    usart_dma_transmit_config(usrt->periph, USART_DENT_DISABLE);
    hal_dma_stop(usrt->p_dma_tx);
    /* disable DMA receive and stop DMA */
    usart_dma_receive_config(usrt->periph, USART_DENR_DISABLE);
    hal_dma_stop(usrt->p_dma_rx);
    
    /* reset the position and state */
    usrt->txbuffer.pos = 0;
    usrt->tx_state = USRT_STATE_FREE;
    usrt->rxbuffer.pos = 0;
    usrt->rx_state = USRT_STATE_FREE;
    
    /* clear interrupt error flags */
    usart_interrupt_flag_clear(usrt->periph, USART_INT_FLAG_PERR);
    usart_interrupt_flag_clear(usrt->periph, USART_INT_FLAG_ERR_FERR);
    usart_interrupt_flag_clear(usrt->periph, USART_INT_FLAG_ERR_NERR);
    usart_interrupt_flag_clear(usrt->periph, USART_INT_FLAG_ERR_ORERR);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      configure the USRT baudrate and stop bits, the other parameters are configured as default values
    \param[in]  usrt: USRT device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  periph: specify which USART is configured
    \param[in]  baud: baudrate
    \param[in]  stopbits: stop bits
      \arg        USRT_STOP_BIT_1: 1 bit stop bit 
      \arg        USRT_STOP_BIT_2: 2 bits stop bit 
      \arg        USRT_STOP_BIT_1_5: 1.5 bits stop bit 
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32e23x_hal.h
*/
int32_t hal_usrt_simple_config(hal_usrt_dev_struct *usrt, uint32_t periph, uint32_t baud, uint32_t stopbits)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == usrt){
        HAL_DEBUGE("parameter [usrt] value is invalid");
        return HAL_ERR_ADDRESS;
    }
    
    /* check the parameters */
    if(((USART0 != periph) && (USART1 != periph)) || (0U == baud)){
        HAL_DEBUGE("parameter [periph] or [baud] value is invalid"); 
        return HAL_ERR_VAL;
    }
    
    /* check the parameters */
    if((USART_STB_1BIT != stopbits) && (USART_STB_1_5BIT != stopbits) && (USART_STB_2BIT != stopbits)){
        HAL_DEBUGE("parameter [stopbits] value is invalid");
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the transfer state */
    if((USRT_STATE_BUSY == usrt->tx_state) || (USRT_STATE_BUSY == usrt->rx_state)){
        HAL_DEBUGE("usrt is in tx or rx state, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    usrt->periph = periph;
    /* deinitilize USART */
    usart_deinit(periph);
    /* configure the UART baudrate and stop bits */
    usart_baudrate_set(periph, baud);
    usart_stop_bit_set(periph, stopbits);
    /* the other parameters are configured as default values */
    usart_parity_config(periph, USART_PM_NONE);
    usart_word_length_set(periph, USART_WL_8BIT);
    usart_receive_config(periph, USART_RECEIVE_ENABLE);
    usart_transmit_config(periph, USART_TRANSMIT_ENABLE);
    
