SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_usrt.c
    return HAL_ERR_NONE;
}

/*!
    \brief      configure the USRT clock polarity, phase and last bit
    \param[in]  usrt: USRT device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  periph: specify which USART is configured
    \param[in]  clock_polarity_phase: clock polarity and phase
      \arg        USRT_POLARITY_LOW_PHASE_1CK: polarity low and phase on 1st clock
      \arg        USRT_POLARITY_LOW_PHASE_2CK: polarity low and phase on 2nd clock 
      \arg        USRT_POLARITY_HIGH_PHASE_1CK: polarity high and phase on 1st clock 
      \arg        USRT_POLARITY_HIGH_PHASE_2CK: polarity high and phase on 2nd clock
    \param[in]  clock_lastbit: clock length lastbit output
      \arg        USRT_LAST_BIT_NOT_OUTPUT: the clock pulse of the last data bit (MSB) is not output to the CK pin
      \arg        USRT_LAST_BIT_OUTPUT: the clock pulse of the last data bit (MSB) is output to the CK pin
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32e23x_hal.h
*/
int32_t hal_usrt_simple_clock_config(hal_usrt_dev_struct *usrt, uint32_t periph, \
                              uint32_t clock_polarity_phase, uint32_t clock_lastbit)
{
    uint8_t uen_flag = 0U;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == usrt){
        HAL_DEBUGE("parameter [usrt] value is invalid");
        return HAL_ERR_ADDRESS;
    }
    
    /* check the parameters */
    if((USART0 != periph) && (USART1 != periph)){
        HAL_DEBUGE("parameter [periph] value is invalid"); 
        return HAL_ERR_VAL;
    }
    
    /* check the parameter */
    if((USRT_POLARITY_LOW_PHASE_1CK != clock_polarity_phase) && (USRT_POLARITY_LOW_PHASE_2CK != \
            clock_polarity_phase) && (USRT_POLARITY_HIGH_PHASE_1CK != clock_polarity_phase) && \
            (USRT_POLARITY_HIGH_PHASE_2CK != clock_polarity_phase)){
        HAL_DEBUGE("parameter [clock_polarity_phase] value is invalid");
        return HAL_ERR_VAL;
    }
    
    /* check the parameter */
    if((USRT_LAST_BIT_NOT_OUTPUT != clock_lastbit) && (USRT_LAST_BIT_OUTPUT != clock_lastbit)){
        HAL_DEBUGE("parameter [clock_lastbit] value is invalid"); 
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the rx and tx state whether is in busy state */
    if((USRT_STATE_BUSY == usrt->tx_state) || (USRT_STATE_BUSY == usrt->rx_state)){
        HAL_DEBUGE("usrt is in tx or rx state, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    usrt->periph = periph;
    /* check whether the UEN is set or not */
    if(RESET != (USART_CTL0(periph) & USART_CTL0_UEN)){
        uen_flag = 1U;
        usart_disable(periph);
    }
    
    /* reset USART_CTL1 CLEN,CPH,CPL bits */
    USART_CTL1(periph) &= ~(USART_CTL1_CLEN | USART_CTL1_CPH | USART_CTL1_CPL);
    USART_CTL1(periph) |= (clock_polarity_phase | clock_lastbit);
    /* restore the state of UEN bit */
    if(0U != uen_flag){
        usart_enable(periph);
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      get the mask of date bit
    \param[in]  usrt: USRT device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     the mask of date bit(0x7F, 0xFF, 0x1FF)
*/
static uint16_t _usrt_data_bit_mask_get(hal_usrt_dev_struct *usrt)
{
    uint16_t reval;
    
    if(RESET != (USART_CTL0(usrt->periph) & USART_CTL0_WL)){
        /* check whether the PCEN is enabled */
        if(RESET != (USART_CTL0(usrt->periph) & USART_CTL0_PCEN)){
            reval = 0xFFU;
        }else{
            reval = 0x1FFU;
        }
    }else{
        /* check whether the PCEN is enabled */
        if(RESET != (USART_CTL0(usrt->periph) & USART_CTL0_PCEN)){
            reval = 0x7FU;
        }else{
            reval = 0xFFU;
        }
    }
    
    return reval;
}

/*!
    \brief      get USRT error flag
    \param[in]  usrt: USRT device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     SET or RESET
*/
static FlagStatus _usrt_error_flag_get(hal_usrt_dev_struct *usrt)
{
    if(0U == (USART_STAT(usrt->periph) & (uint32_t)(USART_STAT_PERR | USART_STAT_FERR | \
                                                    USART_STAT_ORERR | USART_STAT_NERR))){
        return RESET;
    }else{
        return SET;
    }
}

/*!
    \brief      handle the transmit complete interrupt
    \param[in]  usrt: pointer to a UART device information structure
    \param[out] none
    \retval     none
*/
static void _usrt_transmit_complete_interrupt(void *usrt)
{
    hal_usrt_dev_struct *p_usrt = usrt;
    hal_usrt_user_cb p_func = (hal_usrt_user_cb)p_usrt->tx_callback;
    if(USRT_STATE_BUSY_TX_RX == p_usrt->tx_state){
        /* in Tx Rx state, the callback function is called when receive complete event occurs */
        p_func = NULL;
    }
    
    /* disable the transmit complete interrupt */
    usart_interrupt_disable(p_usrt->periph, USART_INT_TC);
    /* reset transmit_complete_handle and tx_state */
    p_usrt->usrt_irq.transmit_complete_handle = NULL;
    p_usrt->tx_state = USRT_STATE_FREE;
    
    if(NULL != p_func){
        /* if there is a user transmit complete callback */
        p_func(p_usrt);
    }
}

/*!
    \brief      handle the transmit interrupt
    \param[in]  usrt: pointer to a UART device information structure
    \param[out] none
    \retval     none
*/
static void _usrt_transmit_interrupt(void *usrt)
{
    uint32_t temp_val;
    hal_usrt_dev_struct *p_usrt = usrt;
    
    temp_val = p_usrt->txbuffer.pos;
    if(temp_val < p_usrt->txbuffer.length){
        if((RESET != (USART_CTL0(p_usrt->periph) & USART_CTL0_WL)) && \
           (RESET == (USART_CTL0(p_usrt->periph) & USART_CTL0_PCEN))){
            /* 9-bit data, none parity */
            usart_data_transmit(p_usrt->periph, (*(uint16_t*)p_usrt->txbuffer.buffer & (uint16_t)0x1FFU));
            p_usrt->txbuffer.buffer += 2U;
        }else{
            /* 9-bit data, with parity or 8-bit data */
            usart_data_transmit(p_usrt->periph, (*p_usrt->txbuffer.buffer & (uint8_t)0xFFU));
            p_usrt->txbuffer.buffer++;
        }
        p_usrt->txbuffer.pos++;
    }else{
        /* disable the TBE interrupt, enable the TC interrupt and reset the transmit_ready_handle */
        usart_interrupt_disable(p_usrt->periph, USART_INT_TBE);
        usart_interrupt_enable(p_usrt->periph, USART_INT_TC);
        p_usrt->usrt_irq.transmit_ready_handle = NULL;
    }
}

/*!
    \brief      handle the receive interrupt
    \param[in]  usrt: pointer to a UART device information structure
    \param[out] none
    \retval     none
*/
static void _usrt_receive_interrupt(void *usrt)
{
    uint16_t recv_data;
    hal_usrt_dev_struct *p_usrt = usrt;
    uint32_t temp_val;
    
    recv_data = (usart_data_receive(p_usrt->periph) & p_usrt->data_bit_mask);
    if(0x1FFU == p_usrt->data_bit_mask){
        /* store the received data */
        *(uint16_t *)p_usrt->rxbuffer.buffer = recv_data;
        p_usrt->rxbuffer.buffer += 2U;
    }else{
        /* store the received data */
        *p_usrt->rxbuffer.buffer = (uint8_t)recv_data;
        p_usrt->rxbuffer.buffer++;
    }
    p_usrt->rxbuffer.pos++;
    
    temp_val = p_usrt->rxbuffer.pos;
    if(temp_val == p_usrt->rxbuffer.length){
        hal_usrt_user_cb p_func = (hal_usrt_user_cb)p_usrt->rx_callback;
        /* disable PERR, ERR, RBNE interrupt */
        usart_interrupt_disable(p_usrt->periph, USART_INT_PERR);
        usart_interrupt_disable(p_usrt->periph, USART_INT_ERR);
        usart_interrupt_disable(p_usrt->periph, USART_INT_RBNE);
        /* reset receive_complete_handle and rx_state */
        p_usrt->usrt_irq.receive_complete_handle = NULL;
        p_usrt->rx_state = USRT_STATE_FREE;
        
        if(NULL != p_func){
            /* if there is a user receive complete callback */
            p_func(p_usrt);
        }
    }
}

/*!
    \brief      handle the transmit and receive interrupt
    \param[in]  usrt: pointer to a UART device information structure
    \param[out] none
    \retval     none
*/
static void _usrt_tx_rx_interrupt(void *usrt)
{
    uint16_t recv_data;
    hal_usrt_dev_struct *p_usrt = usrt;
    uint32_t temp_val;
    
    if(USRT_STATE_BUSY_TX_RX == p_usrt->tx_state){
        /* check whether the TBE is set or not */
        if(RESET != usart_flag_get(p_usrt->periph, USART_FLAG_TBE)){
            temp_val = p_usrt->txbuffer.pos;
            if(temp_val < p_usrt->txbuffer.length){
                if((RESET != (USART_CTL0(p_usrt->periph) & USART_CTL0_WL)) && \
                   (RESET == (USART_CTL0(p_usrt->periph) & USART_CTL0_PCEN))){
                    /* 9-bit data, none parity */
                    usart_data_transmit(p_usrt->periph, (*(uint16_t*)p_usrt->txbuffer.buffer & (uint16_t)0x1FFU));
                    p_usrt->txbuffer.buffer += 2U;
                }else{
                    /* 9-bit data, with parity or 8-bit data */
                    usart_data_transmit(p_usrt->periph, (*p_usrt->txbuffer.buffer & (uint8_t)0xFFU));
                    p_usrt->txbuffer.buffer++;
                }
                p_usrt->txbuffer.pos++;
            }else{
                /* disable the TBE interrupt */
                usart_interrupt_disable(p_usrt->periph, USART_INT_TBE);
                usart_interrupt_enable(p_usrt->periph, USART_INT_TC);
                p_usrt->usrt_irq.transmit_ready_handle = NULL;
            }
        }
    }
    if(USRT_STATE_BUSY_TX_RX == p_usrt->rx_state){
        /* check whether the RBNE is set or not */
        if(RESET != usart_flag_get(p_usrt->periph, USART_FLAG_RBNE)){
            recv_data = (usart_data_receive(p_usrt->periph) & p_usrt->data_bit_mask);
            if(0x1FFU == p_usrt->data_bit_mask){
                /* 9-bit data, none parity */
                *(uint16_t *)p_usrt->rxbuffer.buffer = recv_data;
                p_usrt->rxbuffer.buffer += 2U;
            }else{
                /* 9-bit data, with parity or 8-bit data */
                *p_usrt->rxbuffer.buffer = (uint8_t)recv_data;
                p_usrt->rxbuffer.buffer++;
            }
            p_usrt->rxbuffer.pos++;
        }
        
        temp_val = p_usrt->rxbuffer.pos;
        if(temp_val == p_usrt->rxbuffer.length){
            hal_usrt_user_cb p_func = (hal_usrt_user_cb)p_usrt->rx_callback;
            /* disable PERR, ERR, RBNE interrupt */
            usart_interrupt_disable(p_usrt->periph, USART_INT_PERR);
            usart_interrupt_disable(p_usrt->periph, USART_INT_ERR);
            usart_interrupt_disable(p_usrt->periph, USART_INT_RBNE);
            /* reset receive_complete_handle and rx_state */
            p_usrt->usrt_irq.receive_complete_handle = NULL;
            p_usrt->rx_state = USRT_STATE_FREE;
            
            if(NULL != p_func){
                /* if there is a user Tx Rx complete callback */
                p_func(p_usrt);
            }
        }
    }
}

/*!
    \brief      handle the USRT DMA transmit process
    \param[in]  dma: pointer to a DMA device information structure
    \param[out] none
    \retval     none
*/
static void _usrt_transmit_dma(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_usrt_dev_struct *p_usrt;
    
    p_dma = (hal_dma_dev_struct*)dma;
    p_usrt = (hal_usrt_dev_struct*)p_dma->p_periph;
    
